# Даны 2 числа a и b. Получить их сумму, разность, произведение и вывести на экран


a = int(input('Введите первое число: '))
b = int(input('Введите второе число: '))
sum_result = a + b
subtraction = a - b
multiply = a * b
print(f'Сумма = {sum_result}')
print(f'Разница = {subtraction}')
print(f'Произведение = {multiply}')
